RT-Thread/rt-thread/bsp/tm4c129x/drivers/drv_eth.c
}

static rt_err_t eth_dev_init(rt_device_t device)
{
    net_device_t net_dev = (net_device_t)device;
    struct netif *psNetif = (net_dev->parent.netif);

    LWIP_ASSERT("psNetif != NULL", (psNetif != NULL));

#if LWIP_NETIF_HOSTNAME
  /* Initialize interface hostname */
  psNetif->hostname = "t4mc";
#endif /* LWIP_NETIF_HOSTNAME */

  /*
   * Initialize the snmp variables and counters inside the struct netif.
   * The last argument should be replaced with your link speed, in units
   * of bits per second.
   */
  //NETIF_INIT_SNMP(psNetif, snmp_ifType_ethernet_csmacd, 1000000);

  net_dev->dma_if = &g_StellarisIFData;

  /* Remember our MAC address. */
  g_StellarisIFData.ethaddr = (struct eth_addr *)&(psNetif->hwaddr[0]);

  /* Initialize the hardware */
  tivaif_hwinit(psNetif);
  return RT_EOK;
}

/* control the interface */
static rt_err_t eth_dev_control(rt_device_t dev, int cmd, void *args)
{
    switch(cmd)
    {
    case NIOCTL_GADDR:
        /* get mac address */
        if(args)
            MAP_EMACAddrGet(EMAC0_BASE, 0, (uint8_t*)args);
        else
            return -RT_ERROR;
        break;

    default :
        break;
    }

    return RT_EOK;
}

/* Open the interface */
static rt_err_t eth_dev_open(rt_device_t dev, rt_uint16_t oflag)
{
    return RT_EOK;
}

/* Close the interface */
static rt_err_t eth_dev_close(rt_device_t dev)
{
    return RT_EOK;
}

/* Read */
static rt_ssize_t eth_dev_read(rt_device_t dev, rt_off_t pos, void* buffer, rt_size_t size)
{
    rt_set_errno(-RT_ENOSYS);
    return 0;
}

/* Write */
static rt_ssize_t eth_dev_write(rt_device_t dev, rt_off_t pos, const void* buffer, rt_size_t size)
{
    rt_set_errno(-RT_ENOSYS);
    return 0;
}

static rt_err_t eth_dev_tx(rt_device_t dev, struct pbuf *p)
{
    return tivaif_transmit((net_device_t)dev, p);
}

static struct pbuf* eth_dev_rx(rt_device_t dev)
{
    rt_err_t result;
    rt_uint32_t temp =0;
    net_device_t net_dev = (net_device_t)dev;
    result = rt_mb_recv(net_dev->rx_pbuf_mb, (rt_ubase_t *)&temp, RT_WAITING_NO);

    return (result == RT_EOK)? (struct pbuf*)temp : RT_NULL;
}

int rt_hw_tiva_eth_init(void)
{
    rt_err_t result;

    /* Clock GPIO and etc */
    tiva_eth_lowlevel_init();
    tiva_eth_mac_addr_init();

    /* init rt-thread device interface */
    eth_dev->parent.parent.init     = eth_dev_init;
    eth_dev->parent.parent.open     = eth_dev_open;
    eth_dev->parent.parent.close    = eth_dev_close;
    eth_dev->parent.parent.read     = eth_dev_read;
    eth_dev->parent.parent.write    = eth_dev_write;
    eth_dev->parent.parent.control  = eth_dev_control;
    eth_dev->parent.eth_rx          = eth_dev_rx;
    eth_dev->parent.eth_tx          = eth_dev_tx;

    result = rt_mb_init(&eth_rx_pbuf_mb, "epbuf",
                        &rx_pbuf_mb_pool[0], sizeof(rx_pbuf_mb_pool)/4,
                        RT_IPC_FLAG_FIFO);
    RT_ASSERT(result == RT_EOK);
    eth_dev->rx_pbuf_mb = &eth_rx_pbuf_mb;


    result = eth_device_init(&(eth_dev->parent), "e0");
    return result;
}
// eth_device_init using malloc
// We use INIT_COMPONENT_EXPORT insted of INIT_BOARD_EXPORT
INIT_COMPONENT_EXPORT(rt_hw_tiva_eth_init);


#if 0
#ifdef RT_USING_FINSH
#include "finsh.h"
void PHY_Read(uint8_t addr)
{
    uint16_t data = EMACPHYRead(EMAC0_BASE, PHY_PHYS_ADDR, addr);
    rt_kprintf("R PHY_REG[0x%02X] = 0x%04X\n", addr, data);
}
FINSH_FUNCTION_EXPORT(PHY_Read, (add));

void PHY_Write(uint8_t addr , uint16_t data)
{
   EMACPHYWrite(EMAC0_BASE, PHY_PHYS_ADDR, addr, data);
    rt_kprintf("W PHY_REG[0x%02X] = 0x%04X\n", addr, data);
}
FINSH_FUNCTION_EXPORT(PHY_Write, (add, data));

void PHY_SetAdd(uint8_t addr0, uint8_t addr1, uint8_t addr2,
                uint8_t addr3, uint8_t addr4, uint8_t addr5)
{
    uint32_t ulUser[2];
    ulUser[0] = (((addr2<<8)|addr1)<<8)|addr0;
    ulUser[1] = (((addr5<<8)|addr4)<<8)|addr3;

    MAP_FlashUserSet(ulUser[0], ulUser[1]);
    MAP_FlashUserSave();
    rt_kprintf("Save to EEPROM. please reboot.");
}
FINSH_FUNCTION_EXPORT(PHY_SetAdd, (add0-add5));
#endif //RT_USING_FINSH
#endif
